Examinator/src/InformationRegisters/ВыданныеПинКодыСУО/ВыданныеПинКодыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыданныеПинКодыСУО</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заблокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеПоказано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспользования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоказаУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдавший</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заблокировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБлокировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Опция</name>
    <type>
      <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииПинКодовСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/СерииПинКодовСУО/СерииПинКодовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииПинКодовСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДлинаКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Уведомление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыПинКодовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонРассылки</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияВебКабинета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияСтандартная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияOpenID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановитьНастройкиАутентификации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьДоступаВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОпций</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПродолжительностьДоступаВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГруппыДоступа</name>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>CatalogRef.ГруппыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обучение</name>
    <attributes>
      <name>Проведение</name>
      <type>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыПользователей</name>
    <attributes>
      <name>ГруппаПользователей</name>
      <type>
        <types>CatalogRef.ГруппыПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазделыФорума</name>
    <attributes>
      <name>РазделФорума</name>
      <type>
        <types>CatalogRef.РазделыФорумаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазделыБиблиотеки</name>
    <attributes>
      <name>РазделБиблиотеки</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Новости</name>
    <attributes>
      <name>Новость</name>
      <type>
        <types>DocumentRef.НовостьСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Рассылка</name>
    <attributes>
      <name>ЭлектронныйАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonForms/МоиПинКодыСУО/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ?(ЗначениеЗаполнено(Параметры.Пользователь), Параметры.Пользователь, Пользователи.ТекущийПользователь());
	
	ЗаполнитьТаблицуактивированныхПинКодов();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура АктивироватьПинКод(Команда)
	
	АктивироватьПинКодНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура АктивироватьПинКодНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеПинКода = РегистрыСведений.ВыданныеПинКодыСУО.КодДоступенДляАктивации(ПинКод, Опция);	
	
	Если ДанныеПинКода.ДоступенДляАктивации Тогда		
		
		РегистрыСведений.ВыданныеПинКодыСУО.АктивироватьКод(ДанныеПинКода.Серия, ДанныеПинКода.Код, Пользователь,,ДанныеПинКода.Опция,Истина);

		ТекстУведомления = РегистрыСведений.ВыданныеПинКодыСУО.ПолучитьТекстУведомленияИЗапомнить(Пользователь);

		Если ЗначениеЗаполнено(ТекстУведомления) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстУведомления);
		КонецЕсли;

		ЗаполнитьТаблицуактивированныхПинКодов();
		
		
	ИначеЕсли ДанныеПинКода.ТребуетсяОпция Тогда
		
		Элементы.Опция.Видимость = Истина;
		
		ДоступныеОпции = Справочники.СерииПинКодовСУО.СтруктураОпцийДляВебКабинета(ДанныеПинКода.Серия);
		
		Элементы.Опция.СписокВыбора.Очистить();
		
		Для каждого Вариант Из ДоступныеОпции.Варианты Цикл		
			Элементы.Опция.СписокВыбора.Добавить(Вариант.Значение, Вариант.Наименование);		
		КонецЦикла;
				
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеПинКода.ТекстОшибки);

	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуактивированныхПинКодов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПинКод = "";
	Опция = "";
	
	Элементы.Опция.Видимость = Ложь;
	
	ПинКоды.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеПинКодыСУО.Серия.Описание КАК Описание,
		|	ВыданныеПинКодыСУО.ДатаИспользования КАК ДатаАктивации,
		|	0 КАК Картинка,
		|	ВыданныеПинКодыСУО.Опция.Наименование КАК Опция
		|ИЗ
		|	РегистрСведений.ВыданныеПинКодыСУО КАК ВыданныеПинКодыСУО
		|ГДЕ
		|	ВыданныеПинКодыСУО.Пользователь = &Пользователь
		|	И ВыданныеПинКодыСУО.Заблокирован = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	ТаблицаПинКодов = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(ТаблицаПинКодов, "ПинКоды");
	
	ПинКоды.Сортировать("ДатаАктивации");
	
КонецПроцедуры


#КонецОбласти
